{
  "slug": "celtic-quest-coasteering-profile",
  "title": "Celtic Quest Coasteering: Pembrokeshire Locals",
  "excerpt": "Celtic Quest Coasteering are a proper Pembrokeshire outfit, run by locals who know these waters like the back of their hands. If you're after an authentic, thrilling, and genuinely Welsh coasteering experience, these are the boys (and girls) to go with.",
  "category": "spotlight",
  "content": "Celtic Quest Coasteering are a proper Pembrokeshire outfit, run by locals who know these waters like the back of their hands. If you're after an authentic, thrilling, and genuinely Welsh coasteering experience, these are the boys (and girls) to go with.\n\n# Celtic Quest Coasteering: Pembrokeshire Locals\n\nLook, Pembrokeshire's got more coasteering operators than you can shake a stick at, so choosing the right one can feel like picking a needle out of a haystack. I've bounced off enough rocks and swallowed enough seawater with different companies to know the good from the average. And Celtic Quest? They're definitely up there with the best, and for reasons beyond just the location.\n\n## History and Ethos\n\nCeltic Quest aren’t some Johnny-come-lately outfit looking to cash in on the adventure tourism boom. They've been at it for years, run by proper Pembrokeshire folk who grew up scrambling around these very cliffs. That local knowledge isn't just a marketing gimmick, it's baked into everything they do.\n\nThey've built their reputation on small groups, personal attention, and a real passion for showing people the beauty (and the raw power) of the Pembrokeshire coast. I've seen some of the bigger operators herd groups of 20+ along the coastline, which frankly spoils the experience. With Celtic Quest, you're more likely to be in a group of 8-10, which means more individual guidance and a better chance to really connect with the environment.\n\n## What Makes Them Different?\n\nBesides the smaller groups, what really sets Celtic Quest apart is their commitment to showcasing the *wild* Pembrokeshire coast. They don't just stick to the usual honey-pots like Blue Lagoon (although they might visit depending on conditions). They'll take you to hidden coves, explore sea caves that only locals know about, and choose routes based on the tide, weather, and your group's ability.\n\nThat flexibility is key. Coasteering isn't a one-size-fits-all activity. If the swell's up and the wind's howling, they'll adjust the route to ensure you still have a thrilling but safe experience. They're also clued in on local wildlife, so keep an eye out for seals, seabirds, and maybe even the odd dolphin.\n\n## The Experience\n\nA typical Celtic Quest coasteering session kicks off with a thorough safety briefing and wetsuit fitting. They provide all the gear you need, including wetsuits (decent quality ones, not those threadbare things you sometimes get), buoyancy aids, and helmets. Once you're kitted out, it's a short walk to the coastline.\n\nThe routes they use vary depending on the location and conditions, but expect a mix of swimming, scrambling, jumping (optional, of course!), and exploring. They'll encourage you to push your boundaries, but never beyond your comfort zone. The guides are excellent at assessing people's abilities and providing encouragement where needed.\n\nI've done a session with them near Abereiddy, starting just north of the Blue Lagoon. It's a cracking spot, with some great jumps and plenty of opportunity for exploring. The water's usually crystal clear, and the scenery is simply stunning. Just remember, the Pembrokeshire coast can be exposed, so even in summer, the wind can whip up and make things feel a lot cooler than you expect.\n\nAnother potential location, depending on the day, is near St. Davids Head. This offers a more rugged and exposed experience, with bigger swells and more challenging terrain. It's not for the faint-hearted, but if you're looking for a real adrenaline rush, this is it.\n\n## Prices and Booking\n\nOkay, let's talk brass tacks. As of the 2025/2026 season, expect to pay around £60-£75 per person for a standard coasteering session with Celtic Quest. This usually covers about 2.5-3 hours on the water.\n\nBooking is essential, especially during peak season (July and August). You can book directly through their website or give them a call. They're pretty responsive and happy to answer any questions you might have.\n\n## Who Is It For?\n\nCeltic Quest's coasteering is suitable for a wide range of abilities, from complete beginners to experienced adventurers. As long as you're reasonably fit and comfortable in the water, you'll be fine. They cater for families with older children (generally 8+), groups of friends, and even solo travelers.\n\nHowever, if you're not a confident swimmer or have a serious fear of heights, coasteering might not be for you. While the jumps are optional, you will need to be able to swim short distances in open water.\n\n## Getting There and Parking\n\nMost of Celtic Quest's coasteering locations are in relatively remote areas of Pembrokeshire. That's part of the appeal, but it also means you'll need your own transport to get there.\n\nParking can be a bit tricky, especially during the summer months. At Abereiddy, for example, the car park can fill up quickly, so it's worth arriving early. Expect to pay around £5 for a day's parking. At St. Davids Head, there's a National Trust car park, which is free for members.\n\nAllow plenty of time for your journey, as the roads in Pembrokeshire can be narrow and winding. From Haverfordwest, it's about a 30-minute drive to Abereiddy, and around 45 minutes to St. Davids Head.\n\n## Other Activities in the Area\n\nPembrokeshire isn't just about coasteering, of course. There's a whole host of other activities to keep you entertained. If you're looking for more water-based adventures, why not try [sea kayaking](pembrokeshire) with TYF Adventure or Preseli Venture? Or if you prefer to stay on dry land, there's some fantastic [hiking](brecon-beacons) along the Pembrokeshire Coast Path.\n\nFor something a bit different, consider a boat trip to Ramsey Island to see the seals and seabirds. Preseli Venture runs regular trips from St. Justinians. And if you're feeling brave, you could even try a spot of [wild swimming](brecon-beacons) in one of the many secluded coves.\n\n## The Verdict\n\nIf you're after an authentic, professionally-run, and genuinely thrilling coasteering experience in Pembrokeshire, you can't go wrong with Celtic Quest. Their local knowledge, small group sizes, and commitment to showcasing the wilder side of the coast make them stand out from the crowd. Just be prepared for a bit of a drive, and remember to bring your sense of adventure!",
  "heroImage": "/images/journal/celtic-quest-coasteering-profile-hero-eab3bc80.jpg",
  "author": "Adventure Wales",
  "regionSlug": "pembrokeshire",
  "activityTypeSlug": "coasteering",
  "tags": [
    "coasteering",
    "guided",
    "coastal"
  ],
  "readTimeMinutes": 4
}