{
  "slug": "family-pembrokeshire-report",
  "title": "A Family of Four Takes on Pembrokeshire",
  "excerpt": "Spending a week in Pembrokeshire with the family doing coasteering and sea kayaking was brilliant, even if the weather tried its best to ruin it. Turns out, even teenagers can be dragged away from their screens for an adventure in the right place.",
  "category": "trip-report",
  "content": "Spending a week in Pembrokeshire with the family doing coasteering and sea kayaking was brilliant, even if the weather tried its best to ruin it. Turns out, even teenagers can be dragged away from their screens for an adventure in the right place.\n\n# A Family of Four Takes on Pembrokeshire\n\nWe needed a holiday. A proper one, away from the endless drizzle of the Brecon Beacons (where we live, funnily enough). The kids, 14 and 16, were glued to their screens, and I was starting to feel like a referee in a very dull game. Pembrokeshire, with its promise of coastline and (hopefully) some sunshine, seemed like the answer.\n\n## Getting There and Getting Settled\n\nThe drive from Brecon to St Davids is about 2.5 hours, mostly on decent A roads. We timed it to avoid rush hour around Swansea. Parking in St Davids itself can be a nightmare in peak season. There's a large pay-and-display car park near the Oriel y Parc Gallery and Visitor Centre (£6 for the day in 2025), which is a good bet if you’re planning on exploring the city itself. We were staying in a self-catering cottage just outside the city, so parking wasn't an issue.\n\nTip: Book your accommodation well in advance, especially if you're going in July or August. Pembrokeshire is popular, and good places get snapped up quickly. We paid £950 for the week, which felt reasonable.\n\n## Coasteering with TYF: A Baptism by Brine\n\nCoasteering was the main event we'd promised the kids. I'd heard good things about TYF Adventure in St Davids, and they didn’t disappoint. I booked their \"Coasteering Classic\" experience for the four of us, which cost £60 per person. Pricey, but worth it, in my opinion.\n\nWe met at their base in St Davids, kitted up with wetsuits, buoyancy aids, and helmets (all provided – thankfully, because squeezing into my own wetsuit is a spectator sport nobody needs to see). The walk down to the coast was short, but the excitement was building.\n\nNow, I'm not going to lie. The water was *cold*. This was early July, but a week of rain beforehand hadn't helped. The initial plunge took my breath away, but after a few minutes, we acclimatised.\n\nOur guide, Rhys, was brilliant. He was patient with the kids (who were initially a bit hesitant), knew the coastline like the back of his hand, and made sure we all felt safe. We scrambled over rocks, jumped into deep pools, and swam through narrow gullies. The kids loved it. Even my daughter, who usually complains about everything, was grinning from ear to ear.\n\nHighlight: Jumping off a rock ledge into a deep pool – about 8 meters high. I nearly bottled it, but Rhys talked me into it. Glad I did.\n\nLowlight: Getting stung by a jellyfish. It was a minor sting, but still unpleasant. Rhys had some vinegar spray, which helped.\n\nIf you’re not comfortable with heights or being in the water, then coasteering isn’t for you. But if you’re up for an adventure and don’t mind getting a bit bashed about, then it’s a must-do in Pembrokeshire. Other operators like Preseli Venture and Activity Pembrokeshire also offer coasteering if TYF are fully booked.\n\n## Sea Kayaking: A Calmer (But Still Exciting) Paddle\n\nThe next day, we decided to try sea kayaking. The weather forecast wasn't great – more rain, of course – but we decided to go for it anyway. We booked a \"Sea Kayaking Safari\" with TYF again, costing between £60-85 depending on group size, as it was a good experience the previous day.\n\nThis time, we launched from Porthclais Harbour, a picturesque little spot a few miles south of St Davids. Parking here is limited, and you have to pay (£3 for a few hours), so get there early.\n\nThe kayaking was a lot more relaxed than the coasteering, but still plenty of fun. We paddled along the coast, exploring hidden coves and admiring the dramatic cliffs. Rhys (again – he was clearly in demand!) pointed out various seabirds and told us about the local geology. The kids enjoyed the freedom of being out on the water, and we even saw a seal bobbing its head up.\n\nThe rain did start to come down after a couple of hours, which made things a bit less enjoyable. But we were already wet anyway, so we just kept paddling.\n\nTip: Take waterproofs, even if the forecast is good. The weather in Pembrokeshire can change in an instant.\n\nWe managed to get back to Porthclais just as the rain turned torrential. We were all soaked and a bit cold, but we had a great time.\n\n## Beyond the Coast: A Few Other Ideas\n\nPembrokeshire isn't just about coasteering and kayaking, of course. There's plenty more to see and do.\n\n*   **Walking the Pembrokeshire Coast Path:** This is a must-do, even if you only do a short section. The views are stunning, and there are plenty of hidden beaches to discover. We walked a section between Whitesands Bay and St Davids Head, which was about 4 miles and took us a couple of hours. Whitesands has a large car park (£5), but it gets very busy in summer.\n*   **Visiting Tenby:** This charming seaside town is well worth a visit. It has a beautiful harbour, sandy beaches, and a castle. It can get very crowded in peak season, so be prepared for queues. Parking is also limited and expensive. While there, consider Tenby Adventure for some more coasteering or kayaking.\n*   **Exploring Ramsey Island:** Take a boat trip from St Davids to Ramsey Island, a RSPB reserve. You can see seals, seabirds, and even dolphins. Preseli Venture offers boat trips, but book in advance.\n\nIf the coast isn't your thing, you could try exploring the Preseli Hills, the source of the bluestones at Stonehenge. It's a wild and rugged landscape, perfect for hiking and mountain-biking. Or, for something completely different, head inland to Oakwood Theme Park for a day of rollercoasters and thrills.\n\nIf you're looking for more challenging outdoor experiences, you could explore Snowdonia for mountain-walking or even attempt a scrambling route like Crib Goch.\n\n## The Verdict: Pembrokeshire is Worth It\n\nDespite the variable weather, we had a fantastic week in Pembrokeshire. The coasteering and kayaking were highlights, and the kids are already asking when we can go back. It wasn't cheap – we spent around £2,000 in total, including accommodation, activities, and food – but it was worth every penny. Pembrokeshire is a special place, and I highly recommend it for a family adventure. Just be prepared for the rain!",
  "heroImage": null,
  "author": "Adventure Wales",
  "regionSlug": "pembrokeshire",
  "activityTypeSlug": null,
  "tags": [
    "coasteering",
    "sea-kayaking",
    "family-friendly"
  ],
  "readTimeMinutes": 4
}