{
  "slug": "tyf-adventure-profile",
  "title": "TYF Adventure: Pembrokeshire's Coasteering Pioneers",
  "excerpt": "TYF Adventure in Pembrokeshire isn't just another adventure company; they practically invented coasteering as we know it, offering exhilarating experiences along the rugged coastline. If you're looking for an experienced guide to lead you jumping off rocks and exploring hidden coves, they're a solid",
  "category": "spotlight",
  "content": "TYF Adventure in Pembrokeshire isn't just another adventure company; they practically invented coasteering as we know it, offering exhilarating experiences along the rugged coastline. If you're looking for an experienced guide to lead you jumping off rocks and exploring hidden coves, they're a solid bet.\n\n# TYF Adventure: Pembrokeshire's Coasteering Pioneers\n\nAlright, let's talk about getting properly wet and wild in Pembrokeshire. If you're itching to chuck yourself off some rocks into the sea, chances are you've heard of TYF Adventure. They're practically synonymous with coasteering in these parts, and for good reason – they were some of the first to offer it commercially.\n\n## A Bit of History: Coasteering's Welsh Roots\n\nBased in St. Davids, TYF has been running adventures since 1986. They started small, with a focus on environmental education, but quickly realised the potential for adventure tourism in the stunning Pembrokeshire Coast National Park. It was their innovation that turned scrambling along the rocks between sea and land into a recognised sport. They pretty much wrote the book on coasteering safety and best practices, so you're in good hands.\n\nThey've expanded since then, offering everything from sea kayaking to surfing lessons, but coasteering remains their bread and butter.\n\n## What Makes TYF Different?\n\nSo, what sets TYF apart from the other adventure operators vying for your attention in Pembrokeshire, like [Preseli Venture](pembrokeshire/preseli-venture) or [Activity Pembrokeshire](pembrokeshire/activity-pembrokeshire)? Here's my take:\n\n*   **Experience:** These lads have been doing this for decades. They know the coastline like the back of their hand, including the tides, currents, and the best spots for jumps (and the ones to avoid).\n*   **Eco-Consciousness:** TYF has a genuine commitment to sustainable tourism. They run courses on environmental awareness and try to minimise their impact on the sensitive coastal environment. It's more than just greenwashing; they genuinely care.\n*   **Location, Location, Location:** Being based right in St. Davids gives them access to some prime coasteering territory. The coastline around St. Davids Head is dramatic, rugged, and perfect for adventure. Plus, it's a lovely little city worth exploring if you want a more laid-back day before or after your adventure.\n*   **Variety:** While coasteering is their signature, they offer a solid range of other activities. If you fancy trying sea kayaking along the Pembrokeshire coast, surfing at Whitesands Bay, or even rock climbing, they've got you covered. It makes them a good choice if you're travelling with a group with varied interests.\n\n## What to Expect on a TYF Coasteering Trip\n\nA typical coasteering session with TYF will run for about 3 hours. Here's the gist:\n\n1.  **Meet-up:** You'll meet at their base in St. Davids. It's easy to find, but parking in St. Davids can be a pain, especially in peak season. Give yourself extra time to find a spot. There are a couple of car parks, but they fill up quickly. Expect to pay around £5 for a few hours.\n2.  **Gear Up:** They provide everything you need: wetsuit, buoyancy aid, helmet. The wetsuits are usually in good condition, but if you're particularly sensitive to the cold, consider bringing a rash vest to wear underneath.\n3.  **Safety Briefing:** Before you hit the water, you'll get a thorough safety briefing from your instructor. Pay attention! They'll cover everything from jumping techniques to what to do if you get caught in a current.\n4.  **Hit the Coast:** Then it's off to the coastline! They usually use a couple of different locations depending on the weather and group's ability, so you might be driven a short distance to the coasteering spot.\n5.  **The Fun Begins:** Expect a mix of swimming, scrambling, jumping, and exploring caves and gullies. The jumps range in height, so you can start small and work your way up. The instructors are good at encouraging you to push your limits (safely, of course!).\n\n## TYF Activities and Prices (2025/2026)\n\nHere’s a breakdown of what TYF offers and what you can expect to pay:\n\n*   **Coasteering Classic:** The classic experience. Expect to pay around £60 per person. Suitable for pretty much everyone, though a basic level of fitness and comfort in the water is essential.\n*   **Sea Kayaking Safari:** Explore the coastline from a different perspective. Prices range from £60-£85 depending on the length of the trip.\n*   **Surfing Lesson:** Head to Whitesands Bay for a beginner-friendly surfing lesson. £60 per person.\n*   **Rock Climbing:** Learn the basics of rock climbing on the Pembrokeshire cliffs. £60 per person.\n\n## Who is TYF Adventure For?\n\nTYF is a good choice for:\n\n*   **First-timers:** Their experienced instructors are great at guiding beginners through their first coasteering experience.\n*   **Families:** Many of their activities are suitable for families with older children (check age restrictions beforehand).\n*   **Eco-conscious travellers:** If you care about supporting a company with strong environmental values, TYF is a good bet.\n*   **Those wanting to explore the St Davids area:** Base yourself nearby and make the most of the amazing Pembrokeshire scenery.\n\nWho might want to look elsewhere?\n\n*   **Those on a super tight budget:** There are slightly cheaper coasteering options available (like [Tenby Adventure](pembrokeshire/tenby-adventure), for example), but TYF’s experience justifies the price in my opinion.\n*   **Those with limited mobility:** Coasteering involves a fair amount of scrambling and swimming, so it's not suitable for everyone. Sea kayaking might be a better option.\n\n## Seasonal Considerations\n\nPembrokeshire is beautiful year-round, but the weather can be unpredictable. Here's what to keep in mind:\n\n*   **Summer (June-August):** Peak season. Expect warmer water (relatively speaking!), but also more crowds. Book well in advance.\n*   **Spring (April-May) & Autumn (September-October):** Shoulder season. Fewer crowds, but the water can be chilly. A good wetsuit is essential.\n*   **Winter (November-March):** Some activities may be limited due to weather conditions. Coasteering is possible, but be prepared for cold water and potentially rough seas. They will probably require a minimum group size too.\n\nNo matter when you go, be prepared for rain. It's Wales, after all!\n\n## Getting There and Around\n\nSt. Davids is located in the far west of Pembrokeshire. If you're driving from Cardiff, expect a journey of around 3-4 hours. Public transport is possible, but it's not the most convenient option. A car is definitely recommended for exploring the wider area.\n\n## Final Thoughts\n\nIf you're looking for a memorable adventure on the Pembrokeshire coast, you can't go wrong with TYF Adventure. Their experience, commitment to safety, and stunning location make them a top choice for coasteering and other outdoor activities. Just remember to book in advance, especially during peak season, and be prepared for the Welsh weather!\n\nAnd while you're in Pembrokeshire, why not check out some other fantastic activities? A walk along the Pembrokeshire Coast Path is a must, or perhaps a visit to the stunning [beaches of the Gower peninsula](gower/beach). Alternatively, for an equally challenging but contrasting adventure, consider canyoning in the [south-wales-valleys](south-wales-valleys/gorge-walking).",
  "heroImage": null,
  "author": "Adventure Wales",
  "regionSlug": "pembrokeshire",
  "activityTypeSlug": "coasteering",
  "tags": [
    "coasteering",
    "sea-kayaking",
    "guided"
  ],
  "readTimeMinutes": 5
}